# Task.Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:
#
# Попросіть користувача ввести свсвій вік (можно використати константу або input()).
#
# - якщо користувачу менше 6 - вивести повідомлення "Де твої батьки?"
#
# - якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
#
# - якщо користувачу більше 65 - вивести повідомлення "Покажіть пенсійне посвідчення!"
#
# - якщо вік користувача містить цифру 7 - вивести повідомлення "Вам пощастить!"
#
# - у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"

age_input = input('Введіть свій вік в цифрах:')
if age_input.isdigit():   # Використовуємо isdigit для того щоб програма дізналася чи цілі числа ми вписали
    age = int(age_input)
    age_str = str(age)  # Переводимо інтове значення у стрінг для того щоб программа могла потім дізнатися чи є 7 у цьому числі
elif '.' in age_input or ',' in age_input:
    print('Введіть ціле число')
    exit()
else:
    print('Введіть ціле число')
    exit()   # Використовуємо метод exit для того щоб не читало далі програму у разі введення не цілого числа ( якщо без нього,то видавало помилку)
if '7' in age_str:
    print("Вам пощастить!")
elif age == 0:
    print('Ви ще не народились!')
elif age < 6:
    print("Де твої батьки?")
elif age < 16:
    print("Це фільм для дорослих!")
elif age > 65:
    print("Покажіть пенсійне посвідчення!")
elif '7' in age_str:
    print("Вам пощастить!")
else:
    print("А білетів вже немає!")
